#### 📖 Terraform Plan ('infra/resources/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
module.apim.data.azurerm_key_vault_secret.support_func_key_default: Still reading... [10s elapsed]
module.apim.data.azurerm_key_vault_secret.support_func_key_default: Still reading... [20s elapsed]
module.apim.data.azurerm_key_vault_secret.support_func_key_default: Still reading... [30s elapsed]
module.apim.data.azurerm_key_vault_secret.support_func_key_default: Still reading... [40s elapsed]
module.apim.data.azurerm_key_vault_secret.support_func_key_default: Still reading... [50s elapsed]
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_user_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.apim.data.azurerm_key_vault_secret.support_func_key_default: Still reading... [1m0s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.function_apps.azurerm_key_vault_secret.func_support_default_key will be created
  + resource "azurerm_key_vault_secret" "func_support_default_key" {
      + content_type            = "token"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01"
      + name                    = "io-wallet-support-func-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.apim.module.apim_v2_wallet_support_api.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-apim-v2-api"
      + api_type              = (known after apply)
      + description           = "Wallet APIs"
      + display_name          = "IO Wallet - Support"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-wallet-support-api"
      + path                  = "api/v1/wallet/support"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-rg-internal"
      + revision              = "1"
      + service_url           = "https://io-p-itn-wallet-user-func-01.azurewebsites.net/api/v1/wallet"
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = jsonencode({})
        }
    }

  # module.apim.module.apim_v2_wallet_support_api.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-apim-v2-api"
      + api_name            = "io-p-wallet-support-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-rg-internal"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                  <base />
                  <set-header name="x-functions-key" exists-action="override">
                      <value>{{io-wallet-support-func-key}}</value>
                  </set-header>
              </inbound>
              <outbound>
                  <base />
              </outbound>
            </policies>
        EOT
    }

  # module.apim.module.apim_v2_wallet_support_api.azurerm_api_management_product_api.this["io-p-wallet-support-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-apim-v2-api"
      + api_name            = "io-p-wallet-support-api"
      + id                  = (known after apply)
      + product_id          = "io-p-wallet-support-api"
      + resource_group_name = "io-p-rg-internal"
    }

  # module.apim.module.apim_v2_wallet_support_product.azurerm_api_management_product.this will be created
  + resource "azurerm_api_management_product" "this" {
      + api_management_name   = "io-p-apim-v2-api"
      + approval_required     = false
      + description           = "Product for support Wallet API"
      + display_name          = "IO WALLET API"
      + id                    = (known after apply)
      + product_id            = "io-p-wallet-support-api"
      + published             = true
      + resource_group_name   = "io-p-rg-internal"
      + subscription_required = true
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Error: KeyVault Secret "io-wallet-support-func-key" (KeyVault URI "https://io-p-itn-wallet-kv-01.vault.azure.net/") does not exist

  with module.apim.data.azurerm_key_vault_secret.support_func_key_default,
  on ../_modules/apim/apim.tf line 74, in data "azurerm_key_vault_secret" "support_func_key_default":
  74: data "azurerm_key_vault_secret" "support_func_key_default" {

::error::Terraform exited with code 1.
```

</details>
